In [12]:
import numpy as np 
import pandas as pd 
import matplotlib as plt
from sklearn import linear_model
from word2number import w2n

In [4]:
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
i = df["test_score(out of 10)"].median()
i

8.0

In [7]:
df["test_score(out of 10)"]=df["test_score(out of 10)"].fillna(i)

In [11]:
df["experience"]=df["experience"].fillna('one')
df
#here we got a refined data with no faults

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        one                    8.0                           9      50000
1        one                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [26]:
#converted words to number
df["experience"]=[1,1,5,2,7,3,10,11]
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           1                    8.0                           9      50000
1           1                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [28]:
reg = linear_model.LinearRegression()
reg.fit(df[["experience","test_score(out of 10)","interview_score(out of 10)"]],df["salary($)"])

LinearRegression()

In [33]:
reg.predict([[12,10,10]])

array([93523.67002192])

In [34]:
reg.coef_

array([3031.1979513 , 1893.22650937, 2485.73083785])

In [35]:
reg.intercept_

13359.721134159743